/* --------------------------------------------------------------------- */
/* Variables                                                             */
/* --------------------------------------------------------------------- */
let userName = "john";

console.log(userName);

/* 다음 내용을 분석한 후, 프로그래밍 할 수 있도록 변수와 상수를 작성해봅니다. ----------- */

// - 갯수 별 상품 가격 계산하기
const price = 12000; // 어차피 제이슨으로 정보값 불러오는 거면 const도 상관ㅇ없는거 아닌지ㅠ?

// - 구매 제품 가격의 총 합
const totalAmount = price + totalAmount;

// - 1년 기준 일(day)자 수
const DAYS_PER_YEAR = 365;
// - 구매 결제 여부
let isPaid = true;
// - 구매 결제 내역
const paidList = {};
// - 브랜드 접두사
const brand = "nike";
// - 오늘의 운세
const luck = "흠";
// - 상품 정보
const productDetail = {};

/* variables ----------------------------------------------------------- */

/* constant variables -------------------------------------------------- */
